app/controllers/videos_controller.rb

SELECT "videos".* FROM "videos" WHERE ("videos"."id" = 1) LIMIT 1
---
  def show
    @video = Video.find(params[:id])

INSERT INTO "videos" ("created_at", "panda_video_id", "title", "updated_at") VALUES ('2010-09-12 06:37:42.919642', '9d0a6814fdf8f370ae81b6cfac64dd0a', '3 Andys', '2010-09-12 06:37:42.919642')
---
  def create
    @video = Video.create!(params[:video])

SELECT "videos".* FROM "videos" ORDER BY created_at DESC LIMIT 5
---
  def index
    @videos = Video.limit(5).order("created_at DESC")